Hey @DiogoFerrao ,
thx for the fast response - I implemented your suggestion and the kubeconfig now gets replaced if the stackit_ske_cluster was changed:
```
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # stackit_ske_cluster.ske will be updated in-place
  ~ resource "stackit_ske_cluster" "ske" {
        id                      = "xxxxxxxx,mycluster"
      + kube_config             = (sensitive value)
      ~ kubernetes_version_used = "1.29.6" -> (known after apply)
        name                    = "mycluster"
      ~ node_pools              = [
          ~ {
                name               = "pool1"
              ~ os_version_used    = "3815.2.1" -> (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # stackit_ske_kubeconfig.ske_config will be replaced due to changes in replace_triggered_by
-/+ resource "stackit_ske_kubeconfig" "ske_config" {
      ~ expires_at     = "2024-07-17T09:52:59Z" -> (known after apply)
      ~ id             = "xxxxxxxx,mycluster,xxxxxxxx" -> (known after apply)
      ~ kube_config    = (sensitive value)
      ~ kube_config_id = "xxxxxxxx" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
I think the validation of the current kubeconfig should be solved on the ske-api side, right?

Regards
Simon